package com.tms.lesson1;

/**
 * Создайте файл с именем Hello.java и со следующим содержимым:
 * public class Hello {
 *     public static void main(String[] args) {
 *         System.out.print("Hello World!");
 *     }
 * }
 *
 * Откройте терминал, перейдите в каталог с файлом и скомпилируйте его:
 * Javac Hello.java
 * Выполните программу при помощи команды:
 * java Hello
 */
public class Hello {

    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}